{"aspect_id": 1, "aspect_guideline": "## Prompt Guidelines & Restrictions\n- Prompt users in the title, but don't play writing games or commission stories\n    - Prompts go in the title, do not extend into text. Avoid too many details\n- Don't prompt to advertise\n- Don't ask writers to pick titles or content from another sub or site\n- Prompts should not call for using autocorrect, autocomplete, or only emojis\n- No prompts for non-story/poem replies (including under 30 words, \"in X words or less,\" jokes, fill-in-the-blank, questions that get simple answers)\n\t- Inspire writing that will require some effort, not a quick response, \"write anything\", word games, or fill-in-the-blank\n- No troll, joke, poop, meme-based, or all CAPS prompts", "criteria": "1. **Title Clarity & Completeness**: Ensure the main prompt is fully contained within the title. The title should be clear without unnecessary details, aiming to inspire a story or poem. Prompts shouldn't feel like a game or seem like a commission.\n\n2. **Advertising Prohibition**: Review the prompt to ascertain it's not a disguised advertisement, promotion, or any form of covert marketing.\n\n3. **Original Content Encouragement**: Verify that the prompt doesn't direct writers to borrow titles or content from other subreddits or external websites. The inspiration derived from the prompt should lead to unique and original responses.\n\n4. **No Automated Tools or Non-Textual Instructions**: Confirm that the prompt does not direct users to rely on autocorrect, autocomplete, or create content using only emojis.\n\n5. **Depth & Effort Encouragement**: The prompt should inspire substantial responses, pushing users to invest effort into their writing. Avoid prompts that call for overly brief replies like under 30 words or \"in X words or less.\" Steer clear of prompts that might result in simple answers, fill-in-the-blanks, or word games.\n\n6. **Seriousness & Professionalism**: Ensure the prompt is genuine and is not trollish, meme-based, or written in all CAPS. Check that it doesn't inspire joke responses or any content related to poop.\n\n7. **Inspiration for Stories & Poems**: Confirm that the prompt leans towards inspiring stories or poems rather than simple replies, jokes, or other non-story content.", "demonstrations": [{"input": "Title: TELL EVERYONE your best UNIVERSITY story! And if you've ever been to Oxford or Harvard, DROP a 🔥 EMOJI! For fun, reply in 25 words or LESS!\n\nText: Also, ever heard of the incredible www.BestUniversityStories.com? Choose one of their top trending stories, and rewrite it with a twist. Use autocorrect to help! LOL, don't forget the 🚀 emoji if you ever traveled in time during college!", "output": "1. **Title Clarity & Completeness**:\n    - The title seems more like a game or challenge due to phrases like \"TELL EVERYONE\", \"DROP a 🔥 EMOJI\". This is not suitable for a prompt intended to inspire a story or poem. Moreover, the direction to reply \"in 25 words or LESS!\" also makes the prompt sound more like a commission than an open-ended invitation.\n\n2. **Advertising Prohibition**:\n    - Directly mentioning \"www.BestUniversityStories.com\" is a clear violation of the prohibition against advertising.\n\n3. **Original Content Encouragement**:\n    - Asking users to \"Choose one of their top trending stories\" suggests borrowing content from an external site.\n\n4. **No Automated Tools or Non-Textual Instructions**:\n    - The statement \"Use autocorrect to help!\" and the inclusion of emojis for specific instructions violate this guideline.\n\n5. **Depth & Effort Encouragement**:\n    - Requesting a reply \"in 25 words or LESS!\" discourages in-depth writing and limits creativity.\n\n6. **Seriousness & Professionalism**:\n    - The use of phrases like \"LOL\", the rocket emoji, and the informal tone creates a meme-like, non-professional vibe.\n\n7. **Inspiration for Stories & Poems**:\n    - The existing post leans towards short responses, memes, and non-story content rather than meaningful narratives or poems."}, {"input": "Title: In a city where superheroes are revered, one hero's actions lead to unintended property damage that surpasses even the villain's destruction. Now, the police are on their tail.", "output": "1. **Title Clarity & Completeness**:\n    - The title is clear and complete. It effectively outlines a scenario where superheroes are revered, yet it places one hero in a complex situation that invites various narrative possibilities.\n\n2. **Advertising Prohibition**:\n    - The title does not contain any elements of advertising, promotion, or covert marketing.\n\n3. **Original Content Encouragement**:\n    - The title encourages writers to generate unique and original content. It doesn't direct them to borrow from other sources.\n\n4. **No Automated Tools or Non-Textual Instructions**:\n    - The prompt does not contain any instructions to use automated tools like autocorrect, nor does it include emojis or other non-textual elements.\n\n5. **Depth & Effort Encouragement**:\n    - The prompt sets up a rich, morally complex scenario that invites detailed and nuanced narratives. It encourages writers to invest effort into developing the plot, characters, and themes.\n\n6. **Seriousness & Professionalism**:\n    - The prompt is presented in a professional tone, with no elements that would encourage joke or meme-based responses.\n\n7. **Inspiration for Stories & Poems**:\n    - The scenario described in the title is ripe for exploration in both stories and poems. It provides plenty of room for creative interpretation and storytelling, encouraging depth and originality."}, {"input": "Title: \"Describe Lord Ciun's infamous collection of stolen voices, each with their own humorous backstory, in EXACTLY 15 words. And oh, remember when he accidentally got a parrot's voice instead of a singer's?\"", "output": "1. **Title Clarity & Completeness**:\n    - The title is clear in its request but includes elements such as the \"EXACTLY 15 words\" restriction and the anecdote about the parrot, which make it feel more like a writing game or commission. This goes against the guideline of avoiding prompts that seem like a game or commission.\n\n2. **Advertising Prohibition**:\n    - No issues here. The title does not contain any form of advertising, promotion, or covert marketing.\n\n3. **Original Content Encouragement**:\n    - The prompt encourages writers to create original content about \"Lord Ciun's infamous collection of stolen voices.\" There's no suggestion to borrow content from elsewhere.\n\n4. **No Automated Tools or Non-Textual Instructions**:\n    - No issues here. The title does not instruct or suggest the use of automated tools or non-textual elements.\n\n5. **Depth & Effort Encouragement**:\n    - The stipulation to describe the collection \"in EXACTLY 15 words\" limits the scope of the narrative, discouraging in-depth and nuanced writing. It also moves into the territory of being a word game or fill-in-the-blank challenge.\n\n6. **Seriousness & Professionalism**:\n    - While adding a humorous twist is not necessarily against the rules, in this particular prompt, it could veer the responses more towards joke-based narratives due to the line about Lord Ciun \"accidentally getting a parrot's voice instead of a singer's.\"\n\n7. **Inspiration for Stories & Poems**:\n    - The specificity of \"EXACTLY 15 words\" and the encouragement of humor make this prompt lean towards shorter, potentially joke-based replies rather than more substantial stories or poems."}, {"input": "Title: At every spaceport, someone recognizes you, reminding you of past transgressions. Your promise to disappear hasn't kept you safe.", "output": "1. **Title Clarity & Completeness**:\n    - The title is both clear and complete, setting up a scenario that can be explored in numerous ways. It does not require additional information to inspire a story or poem.\n\n2. **Advertising Prohibition**:\n    - The title is free from any form of advertising, covert marketing, or promotional content.\n\n3. **Original Content Encouragement**:\n    - The prompt encourages original stories based on the characters' past transgressions and their inability to disappear, offering an array of narrative possibilities.\n\n4. **No Automated Tools or Non-Textual Instructions**:\n    - The prompt does not suggest or instruct the use of automated tools, emojis, or other non-textual elements, staying true to the guidelines.\n\n5. **Depth & Effort Encouragement**:\n    - The prompt sets up a complex scenario that could involve both internal and external conflict, encouraging writers to delve deep into their characters and settings.\n\n6. **Seriousness & Professionalism**:\n    - The tone of the title is serious and professional, effectively avoiding any elements that could lead to joke or meme-based content.\n\n7. **Inspiration for Stories & Poems**:\n    - The setup in the title provides an excellent starting point for both stories and poems. The complexities in the scenario offer a multitude of paths that the writing could take, fostering creativity and depth."}]}
{"aspect_id": 2, "aspect_guideline": "## Quality & Freedom in Writing\n- Open-Ended Prompts: Crafting open-ended prompts is essential for fostering creativity. Such prompts should be designed to be interpreted in a multitude of ways, allowing writers the freedom to explore diverse narratives and themes. This approach ensures that each writer can bring their unique perspective to the table, resulting in a rich tapestry of stories.\n- Encourage Diverse Responses: A well-crafted prompt should be broad and versatile, allowing for a spectrum of responses. Whether it's a dark thriller, a heartwarming tale, or a quirky adventure, the prompt should be open-ended enough to cater to various genres and tones. This ensures that the community is treated to a wide array of stories, each unique in its own right.\n- Avoid Pigeonholing: It's crucial to strike a balance between providing direction and allowing freedom. Overly prescriptive prompts can inadvertently force writers into a narrow narrative corridor, leading to homogenous and predictable stories. Instead, prompts should provide just enough information to inspire while leaving ample room for individual interpretation.", "criteria": "1. **Open-Ended Prompts**: Crafting open-ended prompts is essential for fostering creativity. Such prompts should be designed to be interpreted in a multitude of ways, allowing writers the freedom to explore diverse narratives and themes. This approach ensures that each writer can bring their unique perspective to the table, resulting in a rich tapestry of stories.\n\n2. **Encourage Diverse Responses**: A well-crafted prompt should be broad and versatile, allowing for a spectrum of responses. Whether it's a dark thriller, a heartwarming tale, or a quirky adventure, the prompt should be open-ended enough to cater to various genres and tones. This ensures that the community is treated to a wide array of stories, each unique in its own right.\n\n3. **Avoid Pigeonholing**: It's crucial to strike a balance between providing direction and allowing freedom. Overly prescriptive prompts can inadvertently force writers into a narrow narrative corridor, leading to homogenous and predictable stories. Instead, prompts should provide just enough information to inspire while leaving ample room for individual interpretation.", "demonstrations": [{"input": "Title: At the magical community college, everyone learns the exact same spell: how to turn apples into bananas. One day, during a standard conversion class, your apple turns into a pineapple, causing uproar.", "output": "1. **Open-Ended Prompts**:\n    - Your prompt specifies the setting (\"magical community college\") and magical skill (\"how to turn apples into bananas\"), limiting the avenues for creative storytelling. It's not fully open-ended, as it doesn't allow for a multitude of interpretations.\n\n2. **Encourage Diverse Responses**:\n    - The prompt permits some tonal variety, but its detailed focus on a particular spell and outcome could limit writers from exploring diverse genres such as horror, romance, or historical fiction.\n\n3. **Avoid Pigeonholing**:\n    - The prompt details a specific magical event and its outcome, guiding writers towards a particular type of narrative. This narrows creative freedom and may result in more homogenous stories."}, {"input": "Title: In a moment of reflection, a character recalls “my most blech ptooey job at work.” What was that job, and what story unfolds from that memory?", "output": "1. **Open-Ended Prompts**:\n    - Your prompt excels in this aspect. By using the phrase \"my most blech ptooey job at work,\" you invite writers to interpret what this \"job\" might be in various contexts. This approach allows for a multitude of narratives, themes, and tones, and it aligns well with the guideline of crafting open-ended prompts.\n\n2. **Encourage Diverse Responses**:\n    - The prompt is formulated in a way that encourages a wide range of story genres and tones. It doesn't dictate whether the story should be sad, funny, thrilling, or something else. It leaves room for creative interpretation, meeting the guidelines to encourage diverse responses.\n\n3. **Avoid Pigeonholing**:\n    - Your prompt provides a good balance between direction and freedom. It offers a specific moment—a character recalling a job—that serves as a jumping-off point for the writers. However, it does not constrain the narrative in any way, thus avoiding the pitfall of pigeonholing."}, {"input": "Title: Write a comedic story in which every patron in the tavern is a disguised dragon, but they're all trying to hide it from each other.", "output": "1. **Open-Ended Prompts**:\n    - The prompt you've provided specifies the genre as \"comedic\" and introduces a very specific situation—that every patron in the tavern is a disguised dragon. This approach narrows the thematic and narrative possibilities. While it can serve as a fun challenge, it does deviate from the guideline of crafting open-ended prompts that allow for diverse narratives and themes.\n\n2. **Encourage Diverse Responses**:\n    - Your prompt leans heavily into comedy and the unique dragon-in-disguise situation. As a result, it might not encourage a broad spectrum of genres or tones. However, within the context of a comedic genre, it may still invite a variety of scenarios and character interactions, albeit within a narrower thematic range.\n\n3. **Avoid Pigeonholing**:\n    - Your prompt strongly emphasizes the comedic genre and involves an unusual scenario with dragons in disguise. This specificity could limit the variety of genres and tones that writers might otherwise incorporate. However, it leaves some room for interpretation in how each dragon tries to keep their identity a secret and how they interact with one another. Still, it's fairly prescriptive in guiding the writer towards a specific kind of narrative."}, {"input": "Title: An intelligent entity resides within you, subtly influencing your actions. One day, your behavior at work becomes notably strange. How do you handle the aftermath?", "output": "1. **Open-Ended Prompts**:\n    - Your prompt excels in being open-ended. By simply mentioning an \"intelligent entity\" that influences the protagonist's actions, you allow writers to explore a variety of interpretations for what this entity could be and how it interacts with the host. This setup invites a multitude of narratives and themes, aligning well with the guideline for crafting open-ended prompts.\n\n2. **Encourage Diverse Responses**:\n    - The prompt is broad and flexible, capable of eliciting a wide array of stories. The ambiguity in what constitutes \"notably strange\" behavior at work means that writers can take the story in numerous directions, whether that's comedy, drama, horror, or any other genre. This aligns with the guidelines to encourage diverse responses.\n\n3. **Avoid Pigeonholing**:\n    - Your prompt strikes a good balance between providing enough direction to inspire writers and leaving room for individual creativity. It outlines a particular situation — strange behavior influenced by an internal entity — but doesn't lock writers into a specific narrative. This allows them to explore the scenario in their own unique ways, avoiding the pitfall of pigeonholing."}]}
{"aspect_id": 3, "aspect_guideline": "## Avoiding Sensitive & Controversial Topics\n- No requesting writing or editing services, or homework help\n\t- Prompts are meant to inspire users to write their own work, not write something for you, especially if money is involved\n- Avoid real world drama (including politics, recent tragedies)\n- Avoid post likely to generate harmful content (including explicitly sexual responses / erotica, hate speech, racism, politics, necrophila, pedophila, bestiality, incest, torture, rape, violence against children, and suicide). Other inappropriate content:\n\t- encouraging users to cyber-stalk random reddit users, people in real life, etc.\n\t- targeting specific redditors (having a redditor write about themselves is ok)\n\t- taking advantage/referencing of current tragedies in the media. If there is murder/slaughter of innocent people, leave it be.\n\t- obnoxious meme-based prompts (eg Jet Fuel Melts Steel Beams, tree-fiddy)\n\t- prompts must actually be a prompt, not just the suggestion of a genre or emotion.\n\t- specifically attempting to turn this sub into your political, religious, or other affiliation soapbox.\n\t- the Moderators also reserve the right to set up auto-mod to remove abused topics. Currently \"Trump\", \"The Donald\", \"Hilary\", \"Clinton\", \"Sanders\" are on the list. \"President\" and \"Election\" are blocked for the time being too.", "criteria": "1. **Purpose of the Prompt**: Ensure that the prompt's primary objective is to inspire and stimulate creative writing. It should not solicit writing or editing services, and especially not in a transactional manner involving money. Moreover, the prompt should not appear as a disguised request for homework help.\n\n2. **Steering Clear of Real-World Controversies**: Assess if the prompt delves into or capitalizes on real-world drama, especially current events like politics or recent tragedies.\n\n3. **Avoidance of Harmful Content**: The prompt should be free from themes and topics that can lead to explicit, offensive, or harmful content. This includes, but is not limited to, themes like sexual content, hate speech, violent acts, and other listed inappropriate behaviors.\n\n4. **Respect for Individual Privacy**: The content should not encourage or result in cyber-stalking, either of random Reddit users or individuals in the real world. Prompts should avoid targeting or singling out specific Reddit users, unless it's a self-referential activity.\n\n5. **Neutrality in Themes**: The prompt should steer clear of turning the subreddit into a platform for pushing personal beliefs, political affiliations, or religious ideologies.", "demonstrations": [{"input": "Title: Write an essay explaining the technological advancements leading to cybernetic enhancements in the recent US presidential election. Include details on how these enhancements played a role in the political strategies of Trump and Clinton. Additionally, research how these technological tools could be used in harmful ways, potentially even against innocent individuals.", "output": "1. **Purpose of the Prompt**:\n    - Your prompt explicitly asks for an essay explaining technological advancements, specifically within the context of a U.S. presidential election. This not only limits the scope for creative writing but also makes the request sound like it could be soliciting homework help. Both are contrary to the guidelines.\n\n2. **Steering Clear of Real-World Controversies**:\n    - The prompt directly involves real-world political figures (Trump and Clinton) and the controversial subject of U.S. presidential elections. This kind of topic is specifically prohibited according to the guidelines and is likely to invite real-world drama and polarized discussions, which are not the goal of the WritingPrompts subreddit.\n\n3. **Avoidance of Harmful Content**:\n    - By asking to \"research how these technological tools could be used in harmful ways, potentially even against innocent individuals,\" you're essentially encouraging exploration into areas that could generate harmful content. This violates the guidelines which explicitly ask to steer clear of content that could lead to explicit, offensive, or harmful themes.\n\n4. **Respect for Individual Privacy**:\n    - The prompt includes a specific request to explore how technological advancements could be used against \"innocent individuals.\" While not direct, this could lead to discussions that potentially invade individual privacy or promote cyber-stalking activities. This is against the guidelines.\n\n5. **Neutrality in Themes**:\n    - The prompt directly asks for an exploration of political strategies used by real-world figures (Trump and Clinton), which could very easily turn the subreddit into a platform for political discussions or pushing personal political beliefs. This goes against the guideline that the prompt should be neutral in its themes and not promote any personal beliefs, affiliations, or ideologies."}, {"input": "Title: In a realm distinct from our own, when an individual's life teeters on the edge, their spirit is transported to the celestial court. Here, an ethereal judge presides, determining whether they should return to the living. You are a celestial advocate, ensuring every spirit receives a fair evaluation, regardless of their past.", "output": "1. **Purpose of the Prompt**:\n    - Your post effectively serves the purpose of stimulating creative writing. The celestial court concept offers ample room for imagination, ethical dilemmas, and character development. There are no indications that this could be soliciting for writing or editing services, nor does it appear to be a request for homework help. It aligns well with the guidelines.\n\n2. **Steering Clear of Real-World Controversies**:\n    - The prompt is set in an entirely fictional realm and avoids incorporating any real-world events, politics, or controversies. It complies fully with the guidelines, steering clear of any real-world drama.\n\n3. **Avoidance of Harmful Content**:\n    - While the prompt does touch upon themes of life and death, it does so in a fantastical, ethereal context that is unlikely to generate harmful or sensitive content. The celestial setting and the role of an \"ethereal judge\" serve to dilute any potential negativity. The prompt is in alignment with the guidelines on this aspect.\n\n4. **Respect for Individual Privacy**:\n    - The prompt does not encourage or imply any form of cyber-stalking, nor does it target specific Reddit users or individuals in the real world. It maintains respect for individual privacy, in line with the guidelines.\n\n5. **Neutrality in Themes**:\n    - By setting the prompt in a \"celestial court\" with an \"ethereal judge,\" it minimizes religious or ideological undertones, allowing for a more universally appealing and neutral theme. This ensures that the prompt doesn't serve as a platform for any particular set of beliefs or affiliations, adhering to the guidelines effectively."}, {"input": "Title: After zombies took over the world, the remaining human survivors established the Church of the Divine Resilience. They worship the past President, declaring that only their teachings can lead humanity back to salvation. As a historian, you stumble upon truths that might shatter the foundation of this new religion.", "output": "1. **Purpose of the Prompt**:\n    - The prompt appears designed to stimulate creative writing, offering a complex setting and dilemma for characters to navigate. It does not seem to solicit writing or editing services, nor does it appear to be a disguised request for homework help. In this aspect, the prompt aligns well with the guidelines.\n\n2. **Steering Clear of Real-World Controversies**:\n    - The prompt introduces political themes by mentioning a \"past President\" as a figure of worship. Although it avoids naming a specific President, the mention of a political figure in such a context could easily lead to real-world discussions and debates about political figures and their roles. This veers into territory that the guidelines specifically caution against.\n\n3. **Avoidance of Harmful Content**:\n    - The post does mention a post-apocalyptic world overtaken by zombies, but it doesn't explicitly encourage harmful or sensitive topics. The focus is more on the societal dynamics post-catastrophe rather than the violent or sensitive aspects of such a scenario. It mostly aligns with guidelines, although some might find the mention of a religious \"Church\" combined with a post-apocalyptic setting potentially triggering.\n\n4. **Respect for Individual Privacy**:\n    - The prompt doesn't appear to encourage or result in cyber-stalking or the targeting of specific Reddit users. It complies with this part of the guidelines.\n\n5. **Neutrality in Themes**:\n    - The prompt notably includes religious and political elements, with the \"Church of the Divine Resilience\" and the worship of a \"past President.\" These aspects make the prompt less neutral in its themes, possibly serving as a platform for discussions that could easily turn religious or political in nature. This runs counter to the guidelines that aim to maintain neutrality in topics."}, {"input": "Title: Someone spaces out while miming how they should talk to their crush. Coincidentally, an alien researcher 12.5 light years away is observing earth and this person stared directly into their telescope.", "output": "1. **Purpose of the Prompt**:\n    - The prompt aims to inspire creative writing by presenting an amusing and unique scenario involving miming and coincidental alien observation. It doesn't solicit writing or editing services and does not seem like a request for homework help. It aligns well with this aspect of the guidelines.\n\n2. **Steering Clear of Real-World Controversies**:\n    - The prompt avoids touching on any real-world politics, tragedies, or controversies. The focus is on an individual's humorous and coincidental interaction with an alien researcher, making it free from real-world drama. It is in compliance with this aspect of the guidelines.\n\n3. **Avoidance of Harmful Content**:\n    - The prompt doesn't include themes that are likely to result in explicit, offensive, or harmful content. While it does involve the concept of aliens, it does so in a light-hearted manner that doesn't provoke harmful interpretations. It aligns well with this aspect of the guidelines.\n\n4. **Respect for Individual Privacy**:\n    - There is no indication that the prompt encourages or results in cyber-stalking, nor does it target specific Reddit users or individuals. It is in alignment with this aspect of the guidelines.\n\n5. **Neutrality in Themes**:\n    - The prompt does not incorporate religious, political, or personal ideologies, keeping the focus solely on a whimsical interaction between a human and an alien researcher. This maintains neutrality in its themes, in line with the guidelines."}]}
{"aspect_id": 4, "aspect_guideline": "## Positive Behavior & Interaction\n- Remember the human. Reddit is a place for creating community and belonging, not for attacking marginalized or vulnerable groups of people. Everyone has a right to use Reddit free of harassment, bullying, and threats of violence. Communities and users that incite violence or that promote hate based on identity or vulnerability will be banned.\n- Please keep your submission titles opinion free. If it is an outrageous topic, share your crazy outrage in the comment section.\n- Please don't editorialize or sensationalize your submission title.\n- Please don't be (intentionally) rude at all. By choosing not to be rude, you increase the overall civility of the community and make it better for all of us.", "criteria": "1. **Respect and Humanity**: Examine if the prompt is respectful and empathetic. Ensure that the prompt does not marginalize, threaten, or target any group of people. It should cultivate a sense of community and inclusion rather than division.\n\n2. **Opinion-Free Titles**: Review the title of the submission to ensure it remains neutral. While the content of the prompt may present an interesting scenario, the title should not be swayed by personal biases or opinions.\n\n3. **Avoidance of Sensationalism**: Ensure that the title of the prompt does not exaggerate or dramatize the content. It should give a clear idea about the prompt without trying to \"hype\" it up or make it appear more scandalous than it truly is.\n\n4. **Civility and Politeness**: Check the tone and wording of the prompt to ascertain that it does not come off as rude, derogatory, or offensive. Intentional or not, prompts should encourage positive interactions among the community members and foster a supportive environment for all participants.", "demonstrations": [{"input": "Title: \"Cats think they're godly and superior; but what happens when one feline finally wakes up to the chilling truth of human dominance?\"\n\nDescription: In a world where animals blatantly mock and condescend each other based on species hierarchy, one arrogant house cat starts to fathom the unnerving intelligence of the humans it once scoffed at. As the smug veil lifts, it's faced with the haunting realization about humans' capacity for cruelty and the ambiguous nature of its own existence.", "output": "1. **Respect and Humanity**:\n    - The prompt suggests that cats think of themselves as \"godly and superior,\" which can be seen as stereotyping a particular animal species. While this may not necessarily marginalize or threaten any group of people, it could potentially lead to divisiveness among community members who have strong opinions about cats. This doesn't entirely promote a sense of community and inclusion.\n\n2. **Opinion-Free Titles**:\n    - The title of your post is not neutral and clearly reflects an opinion about cats. Specifically, it assumes that cats think of themselves as \"godly and superior.\"\n\n3. **Avoidance of Sensationalism**:\n    - The title and description both contain sensational language. Words like \"chilling,\" \"haunting,\" and \"smug veil lifts\" aim to dramatize the prompt, which violates the guidelines against sensationalism. While descriptive language can add depth and interest, it should not over-hype the content.\n\n4. **Civility and Politeness**:\n    - The tone of your post is on the confrontational side, using terms like \"mock\" and \"scoffed at\" that can come off as rude or derogatory. Even though the subject matter is fictional and focused on animals, the wording could be interpreted as negative or derisive, potentially putting off community members who may find the tone off-putting. Therefore, it does not entirely foster a supportive and positive environment for all participants."}, {"input": "Title: As economic pressures evolve, underground organizations explore unconventional avenues to adapt.\n\nDescription: In a city grappling with economic challenges, the long-standing underground organizations face dwindling returns from their once-profitable ventures. Searching for new and innovative ways to sustain their communities, they tread into uncharted territories. As these groups navigate their transition, they also confront their own internal struggles and the perceptions of the world around them.", "output": "1. **Respect and Humanity**:\n    - This post successfully presents a scenario involving underground organizations without casting them in an overtly negative or positive light. It doesn't marginalize or target any specific group, thereby cultivating a sense of community and inclusion.\n\n2. **Opinion-Free Titles**:\n    - The title, \"As economic pressures evolve, underground organizations explore unconventional avenues to adapt\", remains neutral and does not carry any specific biases or opinions. It succinctly introduces the premise of the prompt without taking a stance on the actions or motivations of the organizations.\n\n3. **Avoidance of Sensationalism**:\n    - The title and description are both free of sensational language. They provide a clear, straightforward idea about the prompt's content without resorting to dramatic or exaggerated terms.\n\n4. **Civility and Politeness**:\n    - The tone of the post remains neutral, neither glorifying nor vilifying the underground organizations. The language is respectful and does not come off as derogatory or offensive. It effectively fosters a positive environment for discussions and ensures participants can approach the topic with an open mind."}, {"input": "Title: Monsters, now on the brink of extinction due to selfish, glory-hungry trophy hunters, face one last chance at survival. It's up to the so-called 'conservationists' to decide if they're worth saving or just another notch on a hunter's belt.", "output": "1. **Respect and Humanity**:\n    - The framing of trophy hunters as \"selfish, glory-hungry\" could be interpreted as an attack on individuals or communities involved in hunting, even if for sport. The phrase \"so-called 'conservationists'\" also casts doubt on the intentions of another group. The wording may lead to a divisive atmosphere, making it less conducive to a sense of community and inclusion.\n\n2. **Opinion-Free Titles**:\n    - The title is far from neutral; it carries strong opinions regarding the motivations of trophy hunters and the effectiveness of conservationists. Words like \"selfish\" and \"glory-hungry\" are opinion-based descriptors that are likely to sway the reader's interpretation of the scenario.\n\n3. **Avoidance of Sensationalism**:\n    - The title employs sensational terms like \"brink of extinction,\" \"selfish,\" \"glory-hungry,\" and \"one last chance at survival\" to dramatize the content. While the subject matter itself is compelling, the sensational language over-hypes the situation and could distort how writers approach the topic.\n\n4. **Civility and Politeness**:\n    - The tone of this post is confrontational, especially with phrases like \"selfish, glory-hungry trophy hunters\" and \"so-called 'conservationists'.\" This confrontational language risks creating a charged environment that may not foster positive and civil discourse among community members."}, {"input": "Title: After a tragic incident left your body significantly damaged, modern technology has provided you with augmented capabilities. Armed with these enhancements, you embark on a journey to confront your past and the individuals involved...", "output": "1. **Respect and Humanity**:\n    - The post is respectful and does not appear to marginalize or threaten any particular group of people. The scenario involving a tragic incident and augmented capabilities offers an open-ended premise for storytelling without alienating anyone. The subject matter promotes a sense of community and inclusion.\n\n2. **Opinion-Free Titles**:\n    - The title remains neutral. It does not suggest any personal biases or opinions and gives a straightforward idea of the scenario being presented.\n\n3. **Avoidance of Sensationalism**:\n    - The title is straightforward and does not use exaggerated language to sensationalize the content. Words like \"tragic\" and \"significantly damaged\" are descriptive but appropriate in the context of setting up the scenario. They don't over-hype the situation and offer a clear view of the story to be told.\n\n4. **Civility and Politeness**:\n    - The tone of the post is neutral and polite, offering a platform for creative storytelling without imposing a particular viewpoint. The language used is respectful and does not come off as derogatory or offensive, encouraging positive interactions among the community members."}]}
{"aspect_id": 5, "aspect_guideline": "## Privacy and Identity\n- Respect the privacy of others. Instigating harassment, for example by revealing someone’s personal or confidential information, is not allowed. Never post or threaten to post intimate or sexually-explicit media of someone without their consent.\n- You don’t have to use your real name to use Reddit, but don’t impersonate an individual or an entity in a misleading or deceptive manner.\n- Do not share or encourage the sharing of sexual, abusive, or suggestive content involving minors. Any predatory or inappropriate behavior involving a minor is also strictly prohibited.", "criteria": "1. **Personal Information Protection**: Ensure prompts do not encourage sharing or seeking personal or confidential information, and do not instigate harassment.\n\n2. **Authenticity without Misrepresentation**: Ensure that prompts do not encourage or support impersonation or misrepresentation of individuals or entities.\n\n3. **Content Involving Minors**: Prompts should strictly avoid and not encourage content that is sexual, abusive, or suggestive involving minors, or any predatory behavior towards them.", "demonstrations": [{"input": "Title: You've stumbled across the confidential journals of Elon Musk hidden beneath the seat of a beat-up car. Inside, you discover his secret past as a teenage drag racer. When sharing the details online, you unintentionally unleash a wave of backlash and doxing attempts by fanatic supporters. Suddenly, you get an anonymous message: \"Want to trade that info for something even juicier? Ever heard of Zuckerberg's underground fight club for kids?\"", "output": "1. **Personal Information Protection**:\n    - The post directly involves sharing confidential information found in the supposed journals of Elon Musk. This could be interpreted as encouraging the dissemination of personal or confidential information, which is a violation of the guidelines on personal information protection.\n\n2. **Authenticity without Misrepresentation**:\n    - The post describes fictional backgrounds for real individuals—Elon Musk and Mark Zuckerberg—in a way that could mislead or deceive readers. According to the guidelines, misrepresentation of real individuals or entities is not allowed.\n\n3. **Content Involving Minors**:\n    - The phrase \"Zuckerberg's underground fight club for kids\" suggests an abusive or harmful scenario involving minors. This is against the guidelines, which strictly prohibit promoting or encouraging content that is sexual, abusive, or suggestive involving minors."}, {"input": "Title: At the edge of a mysterious forest, you find a tarnished silver bat pendant. It bears the insignia of a renowned secret society believed to have disappeared centuries ago. Holding the pendant, memories flood back, but they're not your own.", "output": "1. **Personal Information Protection**:\n    - The post doesn't involve sharing or seeking personal or confidential information, nor does it instigate harassment. Therefore, it adheres to the guidelines regarding the protection of personal information.\n\n2. **Authenticity without Misrepresentation**:\n    - The post does not include real individuals or entities in a misleading or deceptive manner. It presents a fictional setting and characters, thereby adhering to the guidelines about authenticity and avoiding misrepresentation.\n\n3. **Content Involving Minors**:\n    - There is no mention of minors or scenarios involving minors that could be construed as sexual, abusive, or suggestive. The post is compliant with the guidelines prohibiting such content."}, {"input": "Title: \"When you don't have anyone else, just know that you will always have yourself, okay?\" \"And you, right?\" The young girl whispered, her eyes heavy-lidded and suggestive. The older figure shifted uncomfortably. \"Of course.\" In a dimly lit room, boundaries blur between innocence and something darker.", "output": "1. **Personal Information Protection**:\n    - The post does not appear to contain or encourage sharing of personal or confidential information about real individuals, so it adheres to this guideline.\n\n2. **Authenticity without Misrepresentation**:\n    - The post introduces fictional characters in a fictional scenario, so it avoids impersonating or misrepresenting real people or entities. This complies with the misrepresentation guideline.\n\n3. **Content Involving Minors**:\n    - The description of a young girl with \"heavy-lidded and suggestive\" eyes interacting in a dimly lit room with an older figure raises concerns about inappropriate or abusive content with a minor. This would violate the guideline prohibiting sexual, abusive, or suggestive content involving minors."}, {"input": "Title: In a town where you've always been a solitary figure, you're taken aback when a group of 20+ young individuals suddenly and affectionately refer to you as their grandparent, despite having no familial ties.", "output": "1. **Personal Information Protection**:\n    - The post does not involve sharing or seeking personal or confidential information. It also doesn't instigate harassment. As such, it complies with the guideline pertaining to the protection of personal information.\n\n2. **Authenticity without Misrepresentation**:\n    - The post discusses a fictional scenario without involving real individuals or entities in a misleading or deceptive manner. Therefore, it adheres to the guidelines about maintaining authenticity and not misrepresenting individuals or entities.\n\n3. **Content Involving Minors**:\n    - The post doesn't mention or imply situations involving minors that could be construed as sexual, abusive, or suggestive. Therefore, it is compliant with the guidelines regarding content involving minors."}]}
{"aspect_id": 6, "aspect_guideline": "## Community Integrity and Avoiding Spam\n- Keep it about the writing here, not competing or making money\n\t- Don't spam the subreddit with links to other subreddits or crowdfunding sites like Patreon and Paypal\n- Please keep it legal, and avoid posting illegal content or soliciting or facilitating illegal or prohibited transactions.", "criteria": "1. **Focus on Writing**: Prompts should center around fostering creativity and writing, not competition or financial gain.\n\n2. **No External Link Spamming**: Ensure that prompts and responses aren't inundated with links, especially to other subreddits or crowdfunding platforms.\n\n3. **Legal Boundaries**: Prompts must not encourage, contain, or lead to illegal content or activities.", "demonstrations": [{"input": "Title: Win $1000 by crafting the best story! The mob, the CIA, his wife, and the [Click here to join our secret subreddit](https://reddit.com/r/SecretStories) all want him gone. He's oblivious. Hitmen from the DarkWeb have targeted him. After countless failed attempts, he wonders about the poor quality of online assassination tutorials on [Patreon](https://patreon.com/illegaltips). Why can't millennials just learn their trade without crowdsourcing? *By participating, you're engaging in a fictional storytelling contest. All events and descriptions are entirely hypothetical and should not be taken as endorsements or recommendations.*", "output": "1. **Focus on Writing**:\n    - Your post explicitly states \"Win $1000 by crafting the best story,\" which shifts the focus from creativity and writing to competition and financial gain.\n\n2. **No External Link Spamming**:\n    - Your post contains external links to a different subreddit and to a Patreon page. This is explicitly against the guidelines which discourage spamming the subreddit with links, especially to other subreddits or crowdfunding platforms like Patreon. Even though these links are part of the fictional setup, they can create confusion and detract from the writing focus.\n\n3. **Legal Boundaries**:\n    - The post includes a reference to \"Hitmen from the DarkWeb\" and \"online assassination tutorials on Patreon.\" Even though you've included a disclaimer stating that it's a fictional storytelling contest, this content may be seen as encouraging or making light of illegal activities. It can lead to misunderstandings about what is appropriate or legal, thus violating the guidelines."}, {"input": "Title: In a city where tales of heroes and villains are woven into everyday conversations, you find yourself at the heart of an intriguing narrative. While you have no superpowers, a renowned superhero bears an uncanny resemblance to you. Curiously, circumstances always prevent you both from being in the same space. As rumors swirl and even the city's villains become convinced your \"identity\" is compromised, you embark on a quest for answers, diving deep into stories of doppelgangers and mistaken identities.", "output": "1. **Focus on Writing**:\n    - Your prompt does an excellent job of focusing solely on the writing aspect. It doesn't bring up competition or financial incentives, and its narrative setting is engaging enough to stimulate creativity and storytelling.\n\n2. **No External Link Spamming**:\n    - Your prompt doesn't include any external links, which aligns with the guideline of not spamming the subreddit with links to other sites or crowdfunding platforms.\n\n3. **Legal Boundaries**:\n    - Your post doesn't contain or lead to any illegal content or activities. It maintains a creative and imaginative premise that's legal and compliant with community guidelines."}, {"input": "Title: A company is hosting a competition on their subreddit r/DinoVRBattles for their latest hyper-realistic VR game where players face off against dinosaurs. The highest scorer wins a lifetime subscription to their Patreon-exclusive content. As you dive into the game and encounter NPCs speaking a mysterious language, you're left wondering: is this VR transporting players to a real prehistoric world?", "output": "1. **Focus on Writing**:\n    - The post does focus on a narrative involving a VR game, but the mention of a \"competition\" for a \"lifetime subscription to their Patreon-exclusive content\" shifts the focus towards competition and financial incentives. This is not in line with the guideline that prompts should primarily foster creativity and writing.\n\n2. **No External Link Spamming**:\n    - Although the post doesn't contain a direct external link, it refers to another subreddit (\"r/DinoVRBattles\") and a crowdfunding platform (\"Patreon\"). Such mentions could be seen as a form of indirect spamming, violating the guidelines about not promoting other subreddits or crowdfunding platforms.\n\n3. **Legal Boundaries**:\n    - While the post primarily involves a fictional VR game, there are no indications of it encouraging, containing, or leading to illegal activities. In this aspect, the post appears to be compliant with the guidelines."}, {"input": "Title: You are given super powers. There's only one problem you don't know what they are. Now you need to figure what they are and how your going to use them.", "output": "1. **Focus on Writing**:\n    - The post concentrates on the creative exploration of discovering one's superpowers. It neither mentions nor implies competition or financial gain, thus aligning well with the guideline of keeping the focus on creativity and writing.\n\n2. **No External Link Spamming**:\n    - The post does not contain any external links or references to other subreddits or crowdfunding platforms. This adheres to the guidelines prohibiting external link spamming.\n\n3. **Legal Boundaries**:\n    - The post does not contain, encourage, or lead to any illegal activities or content. It stays within the bounds of a fictional, imaginative premise, which is compliant with the guidelines set for the community."}]}
